; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v7 ?v5)
             (pred_1 ?v3 ?v4)
             (pred_7 ?v7 ?v4)
             (pred_12 ?v2 ?v7 )
	     (pred_6 ?v7)
             (pred_4 ?v10)
             (pred_3 ?v3)
             (pred_2 ?v4)
             (pred_11 ?v7)
             (pred_8 ?v3)
             (pred_5 ?v7)
             (pred_9 ))



(:action op_1
:parameters (?v12 ?v13 ?v1 ?v11)
:precondition (and (pred_4 ?v12) (pred_4 ?v13) (pred_3 ?v1) (pred_2 ?v11)
          (pred_10 ?v12 ?v13) (pred_1 ?v1 ?v11)
                   (pred_7 ?v13 ?v11) (pred_6 ?v12) 
                   (pred_11 ?v13) (pred_8 ?v1))
:effect (and  (pred_5 ?v13) (not (pred_11 ?v13))))


(:action op_2
:parameters (?v12 ?v8)
:precondition (and (pred_4 ?v12) (pred_4 ?v8)
               (pred_6 ?v12) (pred_10 ?v12 ?v8) (pred_5 ?v8))
:effect (and (pred_6 ?v8) (not (pred_6 ?v12))))

(:action op_5
:parameters (?v12 ?v1)
:precondition (and (pred_4 ?v12) (pred_3 ?v1) 
                  (pred_6 ?v12) (pred_12 ?v1 ?v12) (pred_9 ))
:effect (and (pred_8 ?v1)
   (not (pred_12 ?v1 ?v12)) (not (pred_9 ))))


(:action op_4
:parameters (?v12 ?v6 ?v9)
:precondition (and (pred_4 ?v12) (pred_3 ?v6) (pred_3 ?v9)
                  (pred_6 ?v12) (pred_8 ?v9) (pred_12 ?v6 ?v12))
:effect (and (pred_8 ?v6) (pred_12 ?v9 ?v12)
        (not (pred_8 ?v9)) (not (pred_12 ?v6 ?v12))))

(:action op_3
:parameters (?v12 ?v1)
:precondition (and (pred_4 ?v12) (pred_3 ?v1) 
                  (pred_6 ?v12) (pred_8 ?v1))
:effect (and (pred_9 ) (pred_12 ?v1 ?v12) (not (pred_8 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_11 obj_21 obj_04 obj_10 obj_26 obj_25 obj_14 obj_07 obj_24 obj_13 obj_19 obj_08 obj_27 obj_16 obj_20 obj_09 obj_15 obj_06 obj_29 obj_30 obj_02 obj_03 obj_05 obj_12
    obj_22 obj_18
    obj_01 obj_23 obj_28
    )

    (:init
       (pred_9)

       (pred_4 obj_17)
       (pred_4 obj_11)
       (pred_4 obj_21)
       (pred_4 obj_04)
       (pred_4 obj_10)
       (pred_4 obj_26)
       (pred_4 obj_25)
       (pred_4 obj_14)
       (pred_4 obj_07)
       (pred_4 obj_24)
       (pred_4 obj_13)
       (pred_4 obj_19)
       (pred_4 obj_08)
       (pred_4 obj_27)
       (pred_4 obj_16)
       (pred_4 obj_20)
       (pred_4 obj_09)
       (pred_4 obj_15)
       (pred_4 obj_06)
       (pred_4 obj_29)
       (pred_4 obj_30)
       (pred_4 obj_02)
       (pred_4 obj_03)
       (pred_4 obj_05)
       (pred_4 obj_12)
       (pred_2 obj_22)
       (pred_2 obj_18)
       (pred_3 obj_01)
       (pred_3 obj_23)
       (pred_3 obj_28)

       (pred_10 obj_17 obj_26)
       (pred_10 obj_17 obj_11)
       (pred_10 obj_11 obj_25)
       (pred_10 obj_11 obj_21)
       (pred_10 obj_11 obj_17)
       (pred_10 obj_21 obj_14)
       (pred_10 obj_21 obj_04)
       (pred_10 obj_21 obj_11)
       (pred_10 obj_04 obj_07)
       (pred_10 obj_04 obj_10)
       (pred_10 obj_04 obj_21)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_10 obj_04)
       (pred_10 obj_26 obj_13)
       (pred_10 obj_26 obj_25)
       (pred_10 obj_26 obj_17)
       (pred_10 obj_25 obj_19)
       (pred_10 obj_25 obj_14)
       (pred_10 obj_25 obj_11)
       (pred_10 obj_25 obj_26)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_14 obj_21)
       (pred_10 obj_14 obj_25)
       (pred_10 obj_07 obj_27)
       (pred_10 obj_07 obj_24)
       (pred_10 obj_07 obj_04)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_24 obj_16)
       (pred_10 obj_24 obj_10)
       (pred_10 obj_24 obj_07)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_13 obj_26)
       (pred_10 obj_19 obj_09)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_19 obj_25)
       (pred_10 obj_19 obj_13)
       (pred_10 obj_08 obj_15)
       (pred_10 obj_08 obj_27)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_27 obj_06)
       (pred_10 obj_27 obj_16)
       (pred_10 obj_27 obj_07)
       (pred_10 obj_27 obj_08)
       (pred_10 obj_16 obj_29)
       (pred_10 obj_16 obj_24)
       (pred_10 obj_16 obj_27)
       (pred_10 obj_20 obj_30)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_15 obj_06)
       (pred_10 obj_15 obj_08)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_29)
       (pred_10 obj_06 obj_27)
       (pred_10 obj_06 obj_15)
       (pred_10 obj_29 obj_12)
       (pred_10 obj_29 obj_16)
       (pred_10 obj_29 obj_06)
       (pred_10 obj_30 obj_02)
       (pred_10 obj_30 obj_20)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_02 obj_09)
       (pred_10 obj_02 obj_30)
       (pred_10 obj_03 obj_05)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_05 obj_03)
       (pred_10 obj_12 obj_29)
       (pred_10 obj_12 obj_05)
       (pred_11 obj_24)
       (pred_11 obj_08)
       (pred_11 obj_29)
       (pred_7  obj_24 obj_22)
       (pred_7  obj_08 obj_18)
       (pred_7  obj_29 obj_22)
       (pred_5 obj_17)
       (pred_5 obj_11)
       (pred_5 obj_21)
       (pred_5 obj_04)
       (pred_5 obj_10)
       (pred_5 obj_26)
       (pred_5 obj_25)
       (pred_5 obj_14)
       (pred_5 obj_07)
       (pred_5 obj_13)
       (pred_5 obj_19)
       (pred_5 obj_27)
       (pred_5 obj_16)
       (pred_5 obj_20)
       (pred_5 obj_09)
       (pred_5 obj_15)
       (pred_5 obj_06)
       (pred_5 obj_30)
       (pred_5 obj_02)
       (pred_5 obj_03)
       (pred_5 obj_05)
       (pred_5 obj_12)

       (pred_1  obj_01 obj_22)
       (pred_1  obj_23 obj_18)
       (pred_1  obj_28 obj_18)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_23 obj_19)
       (pred_12 obj_28 obj_11)
       (pred_6 obj_03)
    )

    (:goal (and
       (pred_12 obj_01 obj_11)
       (pred_12 obj_28 obj_27)
    ))
(:constraints
  (always (not (pred_6 obj_06)))
)
)

; plan
1. (op_2 obj_03 obj_05)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_05)
   goals met: 0 of 2
2. (op_2 obj_05 obj_12)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_12)
   goals met: 0 of 2
3. (op_5 obj_12 obj_01)
   deleted: (pred_12 obj_01 obj_12) (pred_9)
   added: (pred_8 obj_01)
   goals met: 0 of 2
4. (op_1 obj_12 obj_29 obj_01 obj_22)
   deleted: (pred_11 obj_29)
   added: (pred_5 obj_29)
   goals met: 0 of 2
5. (op_2 obj_12 obj_29)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_29)
   goals met: 0 of 2
6. (op_2 obj_29 obj_16)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_16)
   goals met: 0 of 2
7. (op_2 obj_16 obj_27)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_27)
   goals met: 0 of 2
8. (op_2 obj_27 obj_07)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_07)
   goals met: 0 of 2
9. (op_2 obj_07 obj_04)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_04)
   goals met: 0 of 2
10. (op_2 obj_04 obj_21)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_21)
   goals met: 0 of 2
11. (op_2 obj_21 obj_11)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_11)
   goals met: 0 of 2
12. (op_4 obj_11 obj_28 obj_01)
   deleted: (pred_8 obj_01) (pred_12 obj_28 obj_11)
   added: (pred_8 obj_28) (pred_12 obj_01 obj_11)
   goals met: 1 of 2
13. (op_2 obj_11 obj_21)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_21)
   goals met: 1 of 2
14. (op_2 obj_21 obj_04)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_04)
   goals met: 1 of 2
15. (op_2 obj_04 obj_07)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_07)
   goals met: 1 of 2
16. (op_2 obj_07 obj_27)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_27)
   goals met: 1 of 2
17. (op_3 obj_27 obj_28)
   deleted: (pred_8 obj_28)
   added: (pred_9) (pred_12 obj_28 obj_27)
   goals met: 2 of 2
